zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/coord/main.c
			return true;
		}
	}

	/* If we are here, no short address could be assigned. */
	return false;
}

/* Alert to indicate something has gone wrong in the application */
static void app_alert(void)
{
	while (1) {
		#if LED_COUNT > 0
		LED_Toggle(LED0);
		#endif

		#if LED_COUNT > 1
		LED_Toggle(LED1);
		#endif

		#if LED_COUNT > 2
		LED_Toggle(LED2);
		#endif

		#if LED_COUNT > 3
		LED_Toggle(LED3);
		#endif

		#if LED_COUNT > 4
		LED_Toggle(LED4);
		#endif

		#if LED_COUNT > 5
		LED_Toggle(LED5);
		#endif

		#if LED_COUNT > 6
		LED_Toggle(LED6);
		#endif

		#if LED_COUNT > 7
		LED_Toggle(LED7);
		#endif
		delay_us(0xFFFF);
	}
}

/*
 * @brief Callback function for initiation of broadcast data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
#ifdef SIO_HUB
const char Display_Broadcast_Tx_Count[] = "Broadcast frame Tx count:  %lu\r\n";
#endif
static void bc_data_cb(void *parameter)
{
	/* Store the current MSDU handle to be used for a broadcast data frame.
	 **/
	static uint8_t curr_msdu_handle_temp;
	uint8_t src_addr_mode;
	wpan_addr_spec_t dst_addr;
	uint8_t payload;
#ifdef SIO_HUB
	/*char sio_array[255];*/
#endif

	/*
	 * Request transmission of broadcast data to all devices.
	 *
	 * Since this is a beacon-enabled network,
	 * this request will just queue this frame into the broadcast data
	 *queue.
	 *
	 * Once this the next beacon frame is about to be transmitted,
	 * the broadcast data frame will be announced by setting
	 * the frame pending bit of the frame control field of this particular
	 * beacon frame.
	 *
	 * Immediately after the successful transmission of the beacon frame,
	 * the pending broadcast frame will be transmitted.
	 */
	src_addr_mode = WPAN_ADDRMODE_SHORT;
	dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
	dst_addr.PANId = DEFAULT_PAN_ID;
	/* Broadcast destination address is used. */
	dst_addr.Addr.short_address = BROADCAST;

	payload = (uint8_t)rand(); /* Any dummy data */
	curr_msdu_handle_temp++;     /* Increment handle */
	tx_cnt++;

#ifdef SIO_HUB
	printf(Display_Broadcast_Tx_Count, tx_cnt);
	
#endif

	/* The transmission is direct, but without acknowledgment. */
	if (wpan_mcps_data_req(src_addr_mode,
			&dst_addr,
			1,     /* One octet */
			&payload,
			curr_msdu_handle_temp,
			WPAN_TXOPT_OFF
#if (defined MAC_SECURITY_ZIP) || (defined MAC_SECURITY_2006)			
			,0,NULL,0,0
#endif			
			)
			) {
//		LED_On(LED_DATA);
	} else {
		/*
		 * Data could not be queued into the broadcast queue.
		 * Add error handling if required.
		 */
	}

	/* Start timer to initiate next broadcast data transmission. */
	sw_timer_start(APP_TIMER_BC_DATA,
			((uint32_t)APP_BC_DATA_DURATION_MS * 1000),
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)bc_data_cb,
			NULL);

	parameter = parameter; /* Keep compiler happy. */
}

/*
 * @brief Callback function for initiation of indirect data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
#ifdef SIO_HUB
const char Display_Queue_Device_Data[] = "Queue data for device %u ";
const char Display_MSDU_Handle[] = "(MSDU handle:  %u)\r\n";
#endif
static void indirect_data_cb(void *parameter)
{
	uint8_t cur_device;
	uint8_t src_addr_mode;
	wpan_addr_spec_t dst_addr;
	const char *payload = "Direct Data from Coordinator";

	/* Loop over all associated devices. */
	for (cur_device = 0; cur_device < no_of_assoc_devices; cur_device++) {
#ifdef SIO_HUB
		printf(Display_Queue_Device_Data, (cur_device + 1));
#endif

		/*
		 * Request transmission of indirect data to device.
		 * This will just queue this frame into the indirect data queue.
		 * Once this particular device polls for pending data,
		 * the frame will be delivered to the device.
		 */
		src_addr_mode = WPAN_ADDRMODE_SHORT;
		dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
		dst_addr.PANId = DEFAULT_PAN_ID;
		dst_addr.Addr.short_address
			= device_list[cur_device].short_addr;
		curr_msdu_handle++; /* Increment handle */

#ifdef SIO_HUB
		printf(Display_MSDU_Handle, curr_msdu_handle);
#endif

 	 	if (!wpan_mcps_data_req(src_addr_mode,
				&dst_addr,
				strlen(payload),  /* One octet */ 	 		 
				(uint8_t*)payload,
				curr_msdu_handle,
				WPAN_TXOPT_ACK /* WPAN_TXOPT_INDIRECT_ACK *///@mathi
#if (defined MAC_SECURITY_ZIP) || (defined MAC_SECURITY_2006)				
				,ZIP_SEC_MIN,NULL,ZIP_KEY_ID_MODE,device_list[cur_device].short_addr
#endif					
				)
				)
				 {
		}
	}

	/* Start timer to initiate indirect data transmission. */
	sw_timer_start(APP_TIMER_INDIRECT_DATA,
			((uint32_t)APP_INDIRECT_DATA_DURATION_MS * 1000),
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)indirect_data_cb,
			NULL);

	parameter = parameter; /* Keep compiler happy. */
}
#ifdef GTS_SUPPORT

#ifdef SIO_HUB
const char Display_GTS_Data[] = "GTS data for device %" PRIu8 " ";
#endif
/*
 * @brief Callback function for initiation of gts data transmission
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void gts_data_cb(void *parameter)
{
	uint8_t cur_device;
	uint8_t src_addr_mode;
	wpan_addr_spec_t dst_addr;

	/* Loop over all associated devices. */
	for (cur_device = 0; cur_device < no_of_assoc_devices; cur_device++) {
#ifdef SIO_HUB
		printf(Display_GTS_Data, cur_device + 1);
#endif

		/*
		 * Request transmission of indirect data to device.
		 * This will just queue this frame into the indirect data queue.
		 * Once this particular device polls for pending data,
		 * the frame will be delivered to the device.
		 */
		src_addr_mode = WPAN_ADDRMODE_SHORT;
		dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
		dst_addr.PANId = DEFAULT_PAN_ID;
		dst_addr.Addr.short_address
			= device_list[cur_device].short_addr;

		//payload = (uint8_t)rand(); /* Any dummy data */
		gts_msdu_handle++; /* Increment handle */

#ifdef SIO_HUB
		printf(Display_MSDU_Handle, gts_msdu_handle);
#endif
		if (!wpan_mcps_data_req(src_addr_mode,
				&dst_addr,
				GTS_PAYLOAD_LEN,  /* One octet */
				gts_payload,
				gts_msdu_handle,
				WPAN_TXOPT_GTS_ACK
#ifdef MAC_SECURITY_ZIP
				,ZIP_SEC_MIN,NULL,ZIP_KEY_ID_MODE,device_list[cur_device].short_addr
#endif /*  */
				)) {
			/*
			 * Data could not be queued into the indirect queue.
			 * Add error handling if required.
			 */
		}
	}
    
