zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/coord/main.c
	/* Start timer to initiate indirect data transmission. */
	sw_timer_start(APP_TIMER_GTS_DATA,
			((uint32_t)APP_GTS_DATA_DURATION_MS * 1000),
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)gts_data_cb,
			NULL);
	

	parameter = parameter; /* Keep compiler happy. */
}
#endif
/*
 * @brief Callback function for updating the beacon payload
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be used
 *                  to indicated LED to be switched off)
 */
static void bcn_payload_update_cb(void *parameter)
{
	/*
	 * Counter holding the variable portion of the beacon payload.
	 *
	 * Note: If this is changed, also the define BEACON_PAYLOAD_LEN needs
	 * to be updated accordingly.
	 * If this happens, the PIB attribute macBeaconPayloadLength needs to be
	 * adjusted again as well. Since in this application the length of the
	 * beacon payload never changes, this can be skipped.
	 */
	static uint8_t bcn_payload_cnt;

	/* The counter transmitted in the beacon payload is updated and
	 * the new beacon payload is set.
	 */
	bcn_payload_cnt++;
	bcn_payload_cnt %= 10;
	/* Create printable character. */
	beacon_payload[BEACON_PAYLOAD_LEN - 1] = bcn_payload_cnt + 0x30;
	wpan_mlme_set_req(macBeaconPayload, 
#if (defined MAC_SECURITY_ZIP) || (defined MAC_SECURITY_2006)
	 0,
#endif	 
	 &beacon_payload);

	/* Restart timer for updating beacon payload. */
	sw_timer_start(APP_TIMER_BCN_PAYLOAD_UPDATE,
			((uint32_t)APP_BCN_PAYLOAD_DURATION_MS * 1000),
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)bcn_payload_update_cb,
			NULL);

	parameter = parameter; /* Keep compiler happy. */
}


